import telebot
import random
import os
import threading
from flask import Flask

# Завантажуємо токен
API_TOKEN = os.environ.get('API_TOKEN')
if not API_TOKEN:
    raise ValueError("Не знайдено API_TOKEN! Перевірте змінні середовища.")

bot = telebot.TeleBot(API_TOKEN)
app = Flask(__name__)

WELCOME_IMAGE_URL = "https://i.postimg.cc/9M6sr63K/angel-elohim-sacral-harmony-ohm2kwvmogb3vf6c416z-3.png?text=Вітаю+світла+душа"

TIPS = [
"Дива трапляються навколо тебе. Просто навчися їх помічати ✨",
    "Незалежно від того, наскільки далекою здається мета, йди до неї 🎯",
    "Потрібно поговорити з людиною, з якою, як ти вважаєш, у тебе проблеми 💬",
    "Інтуїція зараз дає тобі правильну відповідь 🔮",
    "Те, що тобі зараз потрібно, — невелика перерва ☕",
    "Приділи увагу своєму тілу, подаруй йому догляд та турботу 🧘‍♀️",
    "Скоро ти на власному прикладі переконаєшся: любов править світом ❤️",
    "Зараз у твоєму житті відбуваються важливі події, хоч тобі так і не здається ⭐",
    "Не витрачай нерви через дрібниці 😌",
    "Слід чекати дива 🪄",
    "Ти побачиш рішення, якщо повіриш у нього 💡",
    "Залиш ситуацію, яка зараз відбувається. Не сумнівайся і не відчувай провини 🚶‍♀️",
    "Компроміс — це не те, що тобі зараз потрібно 💪",
    "Не займайся самоїдством 🤗",
    "Твоє тіло підкаже відповідь 🧠",
    "Проведи вечір наодинці з собою і ні в чому собі не відмовляй. Це допоможе думкам прояснитися 🛋️",
    "Зараз у твоєму житті перехідний період. Не опускай руки, попереду зміни на краще 🌅",
    "Не розпорошуйся, зосередься на головному 🎯",
    "Можливо, щоб досягти мети, тобі доведеться принести жертву ⚖️",
    "Зараз постарайся бути єдиним цілим з усім живим на планеті. Живи в природному ритмі 🌍",
    "Використовуй свою уяву, і відповідь відкриється тобі 🎨",
    "Займися своїм здоров'ям, відпочинь — і в голові проясниться 💚",
    "Твої потреби будуть задоволені ✅",
    "Не муч себе безплідними запитаннями 🚫",
    "Прямо зараз перед тобою відкриваються нові двері. За ними — нова можливість 🚪",
    "Скоро той, хто тобі цікавий, зробить перший крок 💕",
    "Не варто зараз повністю покладатися на удачу. Доведеться використовувати власні здібності 🛠️",
    "Тобі не вистачає завзятості. Не соромся заявляти про свої бажання 🔥",
    "Зараз тобі потрібно проявити зібраність та активність ⚡",
    "Ти зможеш позбутися цього страху 💪",
    "Будь милосердним(ою) і чесним(ою) по відношенню до інших 😇",
    "Ти знайдеш споріднену душу 👥",
    "Зроби що-небудь приємне комусь із близьких друзів. Добро підживить і тебе 🤝",
    "Визнач свої пріоритети і зосередься на них 📋",
    "Дивись на життя з цікавістю 👀",
    "Людина, з якою ти в сварці, скоро запропонує перемир'я 🕊️",
    "Все у світі взаємопов'язане. Тобі потрібно навчитися бачити ці зв'язки, розрізняти причини та наслідки 🔗",
    "Ангел закликає тебе до обережності 👼",
    "Зараз не можна замикатися в собі і відстороюватися від життя �",
    "Довірся своєму серцю ❤️",
    "Не переживай з приводу того, що ще не сталося 🚫",
    "Прямо зараз хтось посилає тобі свою любов. Подумай, хто ця людина 💌",
    "Ти ні в чому не винен(на). Не картай себе даремно 🤗",
    "Готуйся до несподіваної події 🎉",
    "Скоро тобі вдасться знайти небанальний спосіб вирішення своєї проблеми 💡",
    "Зверни увагу на своє коло спілкування. Хтось із знайомих може тобі допомогти 👥",
    "Ангел робить тобі застереження: не кидайся у вир із головою ⚠️",
    "Вчися прощати 🕊️",
    "Прислухайся до себе. Що говорить твоя душа? 🧘‍♀️",
    "Ангел весь час намагається подати тобі знак. Можливо, ця пісня не просто так крутиться у тебе в голові, а цей предмет невипадково трапляється тобі на очі вже котрий раз за останній тиждень 🎵",
    "Не йди на компроміс 🚫",
    "Задумане здійсниться ✅",
    "Звільни свій розум від непотрібних переживань 🧠",
    "Звертай увагу на знаки, які подає тобі ангел 👼",
    "Те, що відбувається зараз, — урок тобі на майбутнє 📚",
    "Зараз на тебе багато чого навалилося, але — хороша новина! — майже всіх цих труднощів тобі вдасться уникнути 🌈",
    "З обережністю приймай зараз будь-які пропозиції ⚠️",
    "Ангел каже, що тебе обманює хтось із оточення 👼",
    "Твоя споріднена душа вже поруч із тобою 💕",
    "Чим частіше ти будеш помічати дива навколо, тим частіше вони будуть відбуватися ✨",
    "Всередині тебе зростає почуття, яке ти вперто не хочеш помічати 💗",
    "Всесвіт на твоєму боці 🌌",
    "Та чи той, кого ти звинувачуєш у своїх проблемах, швидше за все, ні при чому 🤷‍♀️",
    "Не приховуй свої щирі почуття 💕",
    "Проблема у стосунках, яка хвилює тебе, дуже скоро вирішиться 💑",
    "Тебе переслідує невдача за невдачею? Нічого, зовсім скоро все налагодиться, а ти станеш сильнішим і досвідченішим 💪",
    "Зваж усі 'за' і 'проти' і лише потім вирішуйся ⚖️",
    "Ти вже зустрів(ла) людину, яку шукав(ла) 💕",
    "Можливо, зараз ти навмисно обманюєш себе. Запам'ятай: чесність із самим(ою) собою понад усе 🪞",
    "Не хвилюйся. Твій ангел-хранитель зараз поруч 👼",
    "Впусти в себе правду. Прийми її 🙏",
    "Сприятливий результат можливий ✅",
    "Не треба судити інших. Тобі стане легше, коли ти відмовишся від зайвої оціночності 🙏",
    "Довірся своїй внутрішній природі і дозволь їй проявитися 🌱",
    "Дозволь миру і доброті оселитися у твоєму серці ❤️",
    "Зараз ти відчуваєш тимчасові труднощі, але тобі під силу їх подолати 💪",
    "Тобі допоможуть працьовитість і зосередженість 🎯",
    "Чіткіше сформулюй свій запит до Всесвіту 🌌",
    "Позитивний настрій і віра принесуть у твоє життя любов ❤️",
    "Твій ангел-хранитель наділить тебе мужністю. Все вийде! 👼",
    "Можливо, настав час нових знань. Це можуть бути курси, екскурсія або просто розмова з мудрою людиною 📚",
    "Стосунки, на порозі яких ти стоїш, будуть довгими 💕",
    "Концентруйся на хорошому. Всі твої проблеми вирішаться і забудуться ☀️",
    "Твій внутрішній світ яскравий і багатоликий. Дозволь іншим відчути це 🌈",
    "Скоро ти зможеш насолодитися плодами своєї праці 🍇",
    "Зараз у тебе непростий період, але ти з усім впораєшся 💪",
    "Здається, що все йде не за планом, але це потрібний етап. Скоро настане період стабільності 🌅",
    "Будь відкритим(ою) для нових можливостей. Вір у божественне милосердя і мудрість 🙏",
    "Дозволь ситуації розвиватися природним шляхом 🌱",
    "У ці важкі часи залишайся вірним(ою) собі 💎",
    "Не шкодуй часу на духовне зростання 🧘‍♀️",
    "Зараз ти можеш у це не вірити, але ситуація вирішиться благополучно ✨",
    "Ти можеш довіритися друзям 🤝",
    "Зараз ангел допомагає тобі ще більше, ніж зазвичай. Він відчуває, що ти цього потребуєш 👼",
    "Настає світлий період твого життя. Все буде добре! ☀️",
    "Не намагайся осягнути неосяжне 🌌",
    "Бери собі в союзники тільки тих, у кого добрі наміри 😇",
    "Кожні стосунки — це твій досвід. Не дорікай собі за них 📚",
    "У твоє життя повернеться хтось із твого минулого ⏪",
    "Єдина справжня сила — це вища любов ❤️",
    "Будь готовим(ою) до дива ✨",
    "Не дозволяй нікому впливати на твої почуття 💗",
    "Будь чесним(ою) із самим(ою) собою 🪞",
    "Кожну мить тебе оберігає твій ангел. Пам'ятай про це і не сумуй 👼",
    "Не забувай святкувати свої маленькі щоденні досягнення 🎉",
    "Щоб надалі бути задоволеним(ою) своїм життям, зараз тобі потрібно попрацювати активніше ⚡",
    "Тобі здається, що над твоєю репутацією нависла загроза, але це не так. Не хвилюйся занадто бурхливо 🌊",
    "Настав час помиритися з тим, про кого ти думаєш 🕊️",
    "Заверши незакінчені справи, щоб з легкістю йти далі ✅",
    "Небеса будуть до тебе прихильні ☁️",
    "Уяви, як ангел-хранитель вирішує твою проблему, — і відчуєш полегшення. Знай: ангел завжди на твоєму боці 👼",
    "Зберігай позитивний настрій 😊",
    "Можливо, тобі варто замислитися над тим, щоб змінити справу свого життя 🔄",
    "Всі роблять помилки. Просто продовжуй іти вперед ➡️",
    "Якщо відчуваєш, що тебе не підживлює те, що ти робиш, — відмовся від цього заняття 🚫",
    "Перед тобою відкриваються чудові перспективи. Не лінуйся їх використовувати 🌟",
    "Тебе чекає випробування. Не хвилюйся, ти впораєшся 💪",
    "Щоб прийти до тями, влаштуй собі цифровий детокс: відпочинь від соціальних мереж і новин 📱",
    "Вирішуйся на зміни. Ангел тебе підтримає 👼",
    "Запитай себе: «Як я можу отримати результат найбільш легким способом?» 💭",
    "Постарайся не драматизувати 🎭",
    "Розвивай свої здібності, і удача сама тебе знайде 🍀",
    "Потрібно очистити душу від темних думок, тоді ти зможеш легко і вільно йти далі 🧹",
    "На тебе чекає достаток 💰",
    "Змісти акценти з непотрібного на важливе 🎯",
    "Відповідь на твоє питання полягає в твоїх взаєминах з близькими 👪",
    "Тобі потрібно на деякий час усамітнитися. Задумайся про ретріт 🏞️",
    "Не турбуйся даремно і не намагайся нав'язати природі свою волю. Довірся їй 🌿",
    "З цим випробуванням ти впораєшся 💪",
    "Прогуляйся парком, рішення прийде само 🌳",
    "Остерігайся тиску з боку інших людей ⚠️",
    "Зроби вибір. Відповідь ти вже знаєш ✅",
    "Вір у свої сили. Тобі все під силу 💪",
    "Просто продовжуй вірити 🙏",
    "Якщо тобі здається, що все відбувається без твоєї участі, це ілюзія. Насправді від тебе багато що залежить 🎭",
    "Подивись правді в очі. Зараз ти себе обманюєш 🪞",
    "Ангел розкриває перед тобою двері. Тобі потрібно просто через них пройти 🚪",
    "Варто почекати ⏳",
    "Ти в безпеці 🛡️",
    "Не зациклюйся на вчорашніх перемогах. Йди вперед! ➡️",
    "Ангел тебе почув і зробить усе, щоб допомогти 👼",
    "Позбудься нездорових стосунків. Не бійся самотності, тобі стане тільки легше 🚮",
    "Зателефонуй близькій людині. Такі розмови допомагають 📞",
    "Зараз доведеться де від чого відмовитися, але дуже скоро на зміну тому, від чого ти відмовишся, прийде нове, краще 🔄",
    "Тебе підтримає людина, на яку ти раніше не розраховував(ла) 🤝",
    "Не концентруйся на страхах, інакше їх і будеш до себе притягувати 🧲",
    "Йди далі тим же шляхом, що йдеш зараз ➡️",
    "Не шкодуй зусиль 💪",
    "Не ганяйся за міражами. Не витрачай час свого життя ⏰",
    "Ти впевнен(а), що твої тривоги мають зв'язок із реальністю? 🤔",
    "Ти можеш бути щасливим(ою) уже зараз 😊",
    "Замість того щоб прокручувати проблему в голові, зосередься на пошуку рішення. Склади список плюсів і мінусів, відповідь прийде в процесі 📝",
    "Слідуй внутрішньому пориву 💫",
    "Трохи відпусти контроль. Інакше доведеш себе до нервового зриву 🤯",
    "У тебе попереду радісний час 🎉",
    "У світі багато хорошого. Радій світлу, замість того щоб проклинати темряву ☀️",
    "Всі неприємності обернуться для тебе благом. Наберися терпіння 🙏",
    "Все йде так, як має бути ✅",
    "Не набувай, щоб жити. Живи, щоб здобувати 🌟",
    "Запитай себе: «Навіщо я взагалі про це думаю і витрачаю свій час?» 💭",
    "Спробуй зайнятися творчістю 🎨",
    "Прости себе: твоєї провини тут немає 🤗",
    "Звернися до природи — нехай її могутня сила тобі допоможе. Погуляй у лісі або в ботанічному саду, сходи до річки 🌲",
    "Іноді корисно нічого не робити 😌",
    "Не дозволяй нікому втягувати тебе у свої проблеми 🚫",
    "Похвали себе: ти робиш достатньо 👏",
    "Не намагайся змінити інших 🚫",
    "У цій ситуації тобі потрібно зберігати віру 🙏",
    "Тебе оточують люди з прекрасною душею 😇",
    "Візьми на себе відповідальність за своє життя 🎯",
    "Покладися на свого ангела-хранителя 👼",
    "Перестань застрягати в минулому. Плануй майбутнє 🔮",
    "Твоїх сил вистачить, щоб впоратися з проблемою, що хвилює тебе 💪",
    "Зараз не найкращий момент для цього ⏳",
    "Головне, що тобі зараз потрібно, — це спокій 😌",
    "Ти на правильному шляху ✅",
    "Не втрачай цієї можливості 🎯",
    "Не форсуй події ⏳",
    "Возлюби близьких і станеш по-справжньому щасливим(ою) ❤️",
    "Всі твої нинішні проблеми — безцінний досвід 📚",
    "Тобі потрібно виговоритися комусь 💬",
    "Не тримай зла на тих, хто тобі зашкодив. Це їхні власні труднощі. Тобі ж варто зайнятися своїм майбутнім 🕊️",
    "У тебе починається новий період, і він буде прекрасним 🌟",
    "У твоїй історії починається нова глава. Запам'ятай цей час 📖",
    "Будь спостережливим(ою) 👁️",
    "Поглянь на все з іншого боку 👁️",
    "Світло ангельської любові осяює тебе 👼",
    "Ти все робиш правильно ✅",
    "У тебе вже є чітке бачення того, що робити і куди рухатися 🎯",
    "Настав час розкрити в собі творчий потенціал. Це розширить межі сприйняття, і ти знайдеш нові шляхи виходу зі ситуації, що склалася 🎨",
    "Всесвіт готує тобі сюрприз 🎉"  


]

# Команда /start
@bot.message_handler(commands=['start'])
def start_message(message):
    bot.send_photo(message.chat.id, WELCOME_IMAGE_URL, caption="Привіт, світла душа! 🌸")
    bot.send_message(message.chat.id, "Хочеш підказку? Напиши: /tip")

# Команда /tip
@bot.message_handler(commands=['tip'])
def send_tip(message):
    tip = random.choice(TIPS)
    bot.send_message(message.chat.id, tip)

# Flask-роут для перевірки
@app.route('/')
def home():
    return "Bot is running on Render!"

# Запуск polling у окремому потоці
def run_bot():
    bot.infinity_polling()

if __name__ == "__main__":
    threading.Thread(target=run_bot).start()
    app.run(host="0.0.0.0", port=int(os.environ.get("PORT", 5000)))


